#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<math.h>
#include<locale.h>

double F(double a, double x)
{
	return (0.7 / (3 * a * x + 5 / log(x)));
}

int main()
{
	setlocale(LC_ALL, "Russian");

	double a = 0;
	double x;
	int n;
	printf("Введите a: ");
	if (!scanf("%lf", &a))
	{
		printf("______________________________________________________________\n");
		printf("|_N__|___X___|________Y________|______________A______________|\n");
		for (x = -10, n = 1; x <= 5; x += 1.5, n++)
		{
			printf("| %2d | %5.1lf |  НЕ ВЫЧИСЛЯЕТСЯ |Некорректно введен параметр a| \n", n, x);
		}
		printf("|____|_______|_________________|_____________________________|\n");
		return 0;
	}
	printf("______________________________________________________________\n");
	printf("|_N__|___X___|________Y________|______________A______________|\n");
	for (x = -10, n = 1; x <= 5; x += 1.5, n++)
	{
		if ((x < 0) || (x == 1) || (3 * a * x * log(x) == -5.0)) 
		{
			if (a > 1000000 || a < -1000000) {
				printf("| %2d | %5.1lf |  НЕ ВЫЧИСЛЯЕТСЯ |Не входит в заданный диапазон| \n",
					n, x);
			}
			else {
				printf("| %2d | %5.1lf |  НЕ ВЫЧИСЛЯЕТСЯ | %28.6lf| \n",
					n, x, a);
			}
		}
		else 
		{
			if (a > 1000000 || a < -1000000) {
				printf("| %2d | %5.1lf |  НЕ ВЫЧИСЛЯЕТСЯ |Не входит в заданный диапазон| \n",
					n, x);
			}
			else {
				printf("| %2d | %5.1lf | %15.7lf | %28.6lf| \n",
					n, x, F(a, x), a);
			}
		}
	}
	printf("|____|_______|_________________|_____________________________|\n");
	return 0;
}